ErpTest/src/Catalogs/уатШаблоныСогласования/уатШаблоныСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>уатШаблоныСогласования</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Важность</name>
    <comment>Важность задач точки действия Выполнить для исполнителя</comment>
    <type>
      <types>EnumRef.уатВажность</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантСогласования</name>
    <type>
      <types>EnumRef.уатВариантыСогласования</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеБизнесПроцесса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <comment>в днях</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Исполнители</name>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ErpTest/src/Enums/уатВажность/уатВажность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уатВажность</name>
  <comment>(уат)</comment>
  <enumValues>
    <name>Высокая</name>
  </enumValues>
  <enumValues>
    <name>Средняя</name>
  </enumValues>
  <enumValues>
    <name>Низкая</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Enums/уатВариантыСогласования/уатВариантыСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уатВариантыСогласования</name>
  <comment>(уат)</comment>
  <enumValues>
    <name>Последовательно</name>
  </enumValues>
  <enumValues>
    <name>Параллельно</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Catalogs/уатШаблоныСогласования/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СТАНДАРТНЫХ СОБЫТИЙ ОБЪЕКТА

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ЭтоНовый() И (НЕ ЭтоГруппа) Тогда
		Важность = Перечисления.уатВажность.Средняя;
		ВариантСогласования = Перечисления.уатВариантыСогласования.Последовательно;
	КонецЕсли;	
КонецПроцедуры
